brew "bat"
brew "bottom"
brew "chezmoi"
brew "coreutils"
brew "fd"
brew "fortune"
brew "fzf"
brew "git"
brew "git-crypt"
brew "gnupg"
brew "go"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lsd"
brew "lunchy"
brew "mas"
brew "neovim"
brew "npm"
brew "pinentry-mac"
brew "pre-commit"
brew "procs"
brew "pstree"
brew "python3"
brew "rename"
brew "ripgrep"
brew "sd"
brew "starship"
brew "thefuck"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "calibre"
cask "discord"
cask "firefox"
cask "google-chrome"
cask "joplin"
cask "visual-studio-code"
cask "wezterm"

# App Store installs, find the ID and string to use with `mas list`
mas "1Password for Safari", id: 1569813296
mas "Baking Soda", id: 1601151613
mas "Hand Mirror", id: 1502839586
mas "OneDrive", id: 823766827
mas "Vinegar", id: 1591303229

vscode "chrislajoie.vscode-modelines"
vscode "coolbear.systemd-unit-file"
vscode "DavidAnson.vscode-markdownlint"
vscode "EditorConfig.EditorConfig"
vscode "esphome.esphome-vscode"
vscode "formulahendry.auto-close-tag"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "yzhang.markdown-all-in-one"
