brew "bat"
brew "bottom"
brew "chezmoi"
brew "coreutils"
brew "fd"
brew "fortune"
brew "fzf"
brew "git"
brew "git-crypt"
brew "gnupg"
brew "go"
brew "jq"
brew "lazygit"
brew "lsd"
brew "lunchy"
brew "mas"
brew "neovim"
brew "pinentry-mac"
brew "pre-commit"
brew "procs"
brew "pstree"
brew "python3"
brew "rename"
brew "ripgrep"
brew "sd"
brew "starship"
brew "thefuck"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Use `greedy: true` to update to the latest version even when already installed
cask "1password", greedy: true
cask "1password-cli", greedy: true
cask "discord", greedy: true
cask "firefox", greedy: true
cask "visual-studio-code", greedy: true
cask "wezterm", greedy: true

# App Store installs, find the ID and string to use with `mas list`
mas "1Password for Safari", id: 1569813296
mas "Baking Soda", id: 1601151613
mas "Hand Mirror", id: 1502839586
mas "OneDrive", id: 823766827
mas "Vinegar", id: 1591303229
