brew "bat"
brew "bottom"
brew "chezmoi"
brew "coreutils"
brew "fd"
brew "fortune"
brew "fzf"
brew "git"
brew "git-crypt"
brew "gnupg"
brew "go"
brew "jq"
brew "lazygit"
brew "lsd"
brew "lunchy"
brew "neovim"
brew "pinentry-mac"
brew "pre-commit"
brew "procs"
brew "pstree"
brew "python3"
brew "rename"
brew "ripgrep"
brew "sd"
brew "starship"
brew "thefuck"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "discord"
cask "firefox"
cask "wezterm"
